IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_clk_cfg_regs.xml
<module id="CLK_CFG_REGS" HW_revision="" description="CLK CFG Registers">
	<register id="CLKCFGLOCK1" width="32" page="1" offset="0x2" internal="0" description="Lock bit for CLKCFG registers">
		<bitfield id="CLKSRCCTL1" description="Lock bit for CLKSRCCTL1 register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLKSRCCTL2" description="Lock bit for CLKSRCCTL2 register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLKSRCCTL3" description="Lock bit for CLKSRCCTL3 register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SYSPLLCTL1" description="Lock bit for SYSPLLCTL1 register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SYSPLLMULT" description="Lock bit for SYSPLLMULT register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SYSCLKDIVSEL" description="Lock bit for SYSCLKDIVSEL register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="LOSPCP" description="Lock bit for LOSPCP register" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="XTALCR" description="Lock bit for XTALCR register" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="CLKSRCCTL1" width="32" page="1" offset="0x8" internal="0" description="Clock Source Control register-1">
		<bitfield id="OSCCLKSRCSEL" description="OSCCLK Source Select Bit" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INTOSC2OFF" description="Internal Oscillator 2 Off Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="WDHALTI" description="Watchdog HALT Mode Ignore Bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="CLKSRCCTL2" width="32" page="1" offset="0xa" internal="0" description="Clock Source Control register-2">
		<bitfield id="CANABCLKSEL" description="CANA Bit Clock Source Select Bit" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CANBBCLKSEL" description="CANB Bit Clock Source Select Bit" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="CLKSRCCTL3" width="32" page="1" offset="0xc" internal="0" description="Clock Source Control register-3">
		<bitfield id="XCLKOUTSEL" description="XCLKOUT Source Select Bit" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="SYSPLLCTL1" width="32" page="1" offset="0xe" internal="0" description="SYSPLL Control register-1">
		<bitfield id="PLLEN" description="SYSPLL enable/disable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PLLCLKEN" description="SYSPLL bypassed or included in the PLLSYSCLK path" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SYSPLLMULT" width="32" page="1" offset="0x14" internal="0" description="SYSPLL Multiplier register">
		<bitfield id="IMULT" description="SYSPLL Integer Multiplier" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="FMULT" description="SYSPLL Fractional Multiplier" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="ODIV" description="Output Clock Divider" begin="18" end="16" width="3" rwaccess="RW"/>
	</register>
	<register id="SYSPLLSTS" width="32" page="1" offset="0x16" internal="0" description="SYSPLL Status register">
		<bitfield id="LOCKS" description="SYSPLL Lock Status Bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SLIPS" description="SYSPLL Slip Status Bit" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="SYSCLKDIVSEL" width="32" page="1" offset="0x22" internal="0" description="System Clock Divider Select register">
		<bitfield id="PLLSYSCLKDIV" description="PLLSYSCLK Divide Select" begin="5" end="0" width="6" rwaccess="RW"/>
	</register>
	<register id="XCLKOUTDIVSEL" width="32" page="1" offset="0x28" internal="0" description="XCLKOUT Divider Select register">
		<bitfield id="XCLKOUTDIV" description="XCLKOUT Divide Select" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="LOSPCP" width="32" page="1" offset="0x2c" internal="0" description="Low Speed Clock Source Prescalar">
		<bitfield id="LSPCLKDIV" description="LSPCLK Divide Select" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="MCDCR" width="32" page="1" offset="0x2e" internal="0" description="Missing Clock Detect Control Register">
		<bitfield id="MCLKSTS" description="Missing Clock Status Bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MCLKCLR" description="Missing Clock Clear Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MCLKOFF" description="Missing Clock Detect Off Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OSCOFF" description="Oscillator Clock Off Bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="X1CNT" width="32" page="1" offset="0x30" internal="0" description="10-bit Counter on X1 Clock">
		<bitfield id="X1CNT" description="X1 Counter" begin="9" end="0" width="10" rwaccess="R"/>
		<bitfield id="CLR" description="X1 Counter Clear" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="XTALCR" width="32" page="1" offset="0x32" internal="0" description="XTAL Control Register">
		<bitfield id="OSCOFF" description="XTAL Oscillator powered-down" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SE" description="XTAL Oscilator in Single-Ended mode" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
</module>
